Revit 2026 API

# RebarFreeFormCreationResult Properties

---

The RebarFreeFormCreationResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Error | Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rebar | Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a  Rebar. |

#### Reference

RebarFreeFormCreationResult Class

Autodesk.Revit.DB.Structure Namespace